class 餐點:
    # 餐點類別的建構子
    def __init__(self, 輸入的餐點名稱, 輸入的餐點數量, 輸入的餐點單價):
        # 初始化餐點物件
        self._餐點名稱 = 輸入的餐點名稱
        self._餐點數量 = 輸入的餐點數量
        self._餐點單價 = 輸入的餐點單價
 
    # 計算餐點價格的方法
    def 計算餐點價格(self):
        return self._餐點數量 * self._餐點單價

    # 印出餐點名稱的方法
    def 印出餐點名稱(self):
        print("餐點名稱:", self._餐點名稱)

    # 印出餐點價格的方法
    def 印出餐點價格(self):
        print("價格=", self.計算餐點價格())

    # 印出飲料資訊的方法
    def 印出餐點資訊(self):
        self.印出餐點名稱()
        self.印出餐點價格()

# 創建飲料物件 
餐點物件1 = 餐點("炒飯", 1, 80)
餐點物件2 = 餐點("燴飯", 1, 95)
餐點物件3 = 餐點("煲仔飯", 1, 125)

# 呼叫副函式
餐點物件1.印出餐點資訊()
print("--------------------")
餐點物件2.印出餐點資訊()
print("--------------------")
餐點物件3.印出餐點資訊()
